## 16. 분산
### 주어진 데이터 셋에서 f2가 0값인 데이터를 age를 기준으로 오름차순 정렬하고 앞에서 부터 20개의 데이터를 추출한 후 f1 결측치(최소값)를 채우기 전과 후의 분산 차이를 계산하시오 (소수점 둘째 자리까지)
 - 데이터셋 : basic1.csv

In [1]:
import pandas as pd

df = pd.read_csv("../data/basic1.csv")
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [3]:
# f2가 0값인 데이터를 age를 기준으로 오름차순 정렬
f2_age = df[df['f2']==0].sort_values('age')
f2_age.head()

      id  age city     f1  f2   f3    f4         f5
98  id99  1.0   경기   47.0   0  NaN  ESFJ  97.381034
0   id01  2.0   서울    NaN   0  NaN  ENFJ  91.297791
85  id86  2.0   경기    NaN   0  NaN  ESTP  29.269869
56  id57  3.0   대구  111.0   0  NaN  ISFJ  29.269869
90  id91  6.0   경기   72.0   0  NaN  INTP   9.796378

In [5]:
# 앞에서 부터 20개의 데이터를 추출한 후 
# f1 결측치(최소값)를 채우기 전과 후의 분산 차이

f2_age_20 = f2_age[:20]

# 분산 차이
var1 = f2_age_20['f1'].var()
var2 = f2_age_20['f1'].fillna(f2_age_20['f1'].min()).var()

print(var1)
print(var2)

351.7636363636363
313.32631578947377

In [6]:
print(round(abs(var1-var2), 2))

38.44

<br><br>

## 17. 시계열 데이터1
### 2022년 5월 sales의 중앙값을 구하시오

- 데이터셋 : basic2.csv

In [32]:
import pandas as pd

df = pd.read_csv("../data/basic2.csv")
df.head()

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

In [35]:
### Date 컬럼을 datetime 타입으로 변경

df['Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    datetime64[ns]
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 28.6 KB

In [38]:
# datetime의 dt.year, dt.month, dt.day로 데이터 접근가능
df['Date'].dt.year
df['Date'].dt.month
df['Date'].dt.day

0      2022
1      2022
2      2022
3      2022
4      2022
       ...
725    2023
726    2023
727    2023
728    2023
729    2023
Name: Date, Length: 730, dtype: int64

In [52]:
## datetime 값 비교는 정수와 비교함
may_sales = df['Sales'][(df['Date'].dt.year == 2022) & (df['Date'].dt.month == 5)].median()
may_sales

1477685.0

<br><br>

## 18. 시계열 데이터2
### 주어진 데이터에서 2022년 5월 주말과 평일의 sales컬럼 평균값 차이를 구하시오 (소수점 둘째자리까지 출력, 반올림)
- 데이터셋 : basic2.csv

In [53]:
import pandas as pd

df = pd.read_csv("../data/basic2.csv")
df.head()

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

In [58]:
df['Date'] = pd.to_datetime(df['Date'])

# dt.dayofweek 이용
# 0: 월요일, 6: 일요일
weekend_sales = df['Sales'][(df['Date'].dt.year == 2022) & (df['Date'].dt.month == 5) & (df['Date'].dt.dayofweek > 4)].mean()
print(weekend_sales)

week_sales = df['Sales'][(df['Date'].dt.year == 2022) & (df['Date'].dt.month == 5) & (df['Date'].dt.dayofweek <= 4)].mean()
print(week_sales)

6693950.555555556
3683611.4545454546

In [59]:
print(round(abs(weekend_sales-week_sales), 2))

3010339.1